BoKhongHat/STM32/API/Src/NgatNgoai2.c
/**
 ******************************************************************************
 * @file           : NgatNgoaiV2
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/*
 Yêu cầu: Viết chương trình cấu hình ngắt ngoài cho nút nhấn trên Board STM32401.
Khi có ngắt xảy ra trên chân PB3 thì led trên chân PA0 sẽ được bật và sau đó sẽ trở lại
trạng thái tắt như ban đầu.
*/

#include <stdint.h>
#include <stm32f401re_rcc.h>
#include <stm32f401re_gpio.h>
#include <misc.h>
#include <stm32f401re_exti.h>
#include <stm32f401re_syscfg.h>

//Chân
#define GPIO_PIN_SET 				1
#define GPIO_PIN_RESET			 	0
//#define GPIO_PIN_HIGH 				1
//#define GPIO_PIN_LOW 				0

#define LED_GPIO_PORT 				GPIOA
#define LED_GPIO_PIN 				GPIO_Pin_5
#define LEDControl_SetClock 		RCC_AHB1Periph_GPIOA

#define BUTTON_GPIO_PORT			GPIOB
#define BUTTON_GPIO_PIN				GPIO_Pin_3
#define BUTTONControl_SetClock		RCC_AHB1Periph_GPIOB

#define SYSFG_Clock				RCC_APB2Periph_SYSCFG
uint8_t Status = 1;

static void delay(void);
static void Led_Init(void);
static void Interrupt_Init(void);
static void LedControl_SetStatus(GPIO_TypeDef *GPIOx, uint16_t GPIO_PIN, uint8_t Status);

static void delay(void)
{
	for(uint32_t i = 0; i < 500000; i++);
}

//Cấu hình chân PA5 của Led trên Board ở chế độ OUTPUT

static void Led_Init (void) {
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHB1PeriphClockCmd (LEDControl_SetClock, ENABLE);

	GPIO_InitStructure.GPIO_Pin = LED_GPIO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;

	GPIO_Init (LED_GPIO_PORT, &GPIO_InitStructure);
}

//4:Xây dựng hàm Interruppt_Init cấu hình cho phép ngắt khi nút ấn kết nối
//với chân PC13 khi được ấn như sau:


static void Interrupt_Init(void) {
	//Khai báo các biến thuộc kiểu dữ liệu cấu trúc của GPIO,EXTI và NVIC
	GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef EXTI_InitStucture;
	NVIC_InitTypeDef NVIC_InitStructure;

	//Khởi tạo chân GPIO PC13
	RCC_AHB1PeriphClockCmd (BUTTONControl_SetClock, ENABLE);
	GPIO_InitStructure.GPIO_Pin = BUTTON_GPIO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;

	GPIO_Init (BUTTON_GPIO_PORT, &GPIO_InitStructure);

	//CẤU HÌNH SỬ DỤNG LINE NGẮT Line 3 to PB3 pin

	//Cấp clock cho ngoại vi Syscfg
	RCC_APB2PeriphClockCmd (SYSFG_Clock, ENABLE);
	//Sử dụng hàm confid vs tham số truyền vào là ngắt, ở GPIO
	// nào và Line ngắt nào để kết nối Line ngắt 3 với PC13
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource3);

	//CẤU HÌNH SỬ DỤNG NGẮT

	//Khởi tạo Line13 được sử dụng chức năng ngắt
	EXTI_InitStucture.EXTI_Line = EXTI_Line3;
	//Chọn chế độ ngắt
	EXTI_InitStucture.EXTI_Mode = EXTI_Mode_Interrupt;
	//Chọn sườn xuống phát hiện sự kiện ngắt Falling
	EXTI_InitStucture.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_InitStucture.EXTI_LineCmd = ENABLE;
	//Sử dụng hàm EXTI_Init để khởi tạo tất cả các giá trị trên với
	//đối số là &EXTI_InitStructure
	EXTI_Init (&EXTI_InitStucture);

	//CẤU HÌNH TRÌNH PHỤC VỤ NGẮT NVIC
	NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn; //trình phục vụ ngắt
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; //Cấu hình uu tiên ngắt ở mức 0
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; //cho phép sd trình phục vụ ngắt

	NVIC_Init (&NVIC_InitStructure);

}

void EXTI3_IRQHandler (void) {
	if (EXTI_GetFlagStatus (EXTI_Line3) == SET) {
		//kiểm tra skien ngắt có đúng trên chân PC13 hay khộng
		Status++;
	}

	//Xóa cờ ngắt sau khi thực hiện xong chương trình ngắt
	EXTI_ClearITPendingBit(EXTI_Line3);
}

static void LedControl_SetStatus(GPIO_TypeDef *GPIOx, uint16_t GPIO_PIN, uint8_t Status)
{
	if(Status == GPIO_PIN_SET)
	{
		GPIOx->BSRRL = GPIO_PIN;
	}
	if(Status == GPIO_PIN_RESET)
	{
		GPIOx->BSRRH = GPIO_PIN;
	}
}

int main(void) {

	SystemCoreClockUpdate();
	Led_Init();
	Interrupt_Init();
while(1)
{
	if(Status % 2 != 0)
	{
		LedControl_SetStatus(LED_GPIO_PORT, LED_GPIO_PIN, GPIO_PIN_SET);
	}
	else
	{
		LedControl_SetStatus(LED_GPIO_PORT, LED_GPIO_PIN, GPIO_PIN_RESET);
	}
}

	return 0;
}
